Ran Plan for dir: `terraform/eventbridge` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/eventbridge/crawlinghub-eventbridge-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/eventbridge": exit status 1
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Reading...
data.aws_ssm_parameter.eventbridge_trigger_queue_url: Reading...
aws_cloudwatch_event_rule.crawler_scheduler: Refreshing state... [id=crawlinghub-scheduler-prod]
aws_iam_role.eventbridge_sqs: Refreshing state... [id=crawlinghub-eventbridge-sqs-role-prod]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-arn]
data.aws_ssm_parameter.eventbridge_trigger_queue_url: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-url]
aws_iam_role_policy.eventbridge_sqs: Refreshing state... [id=crawlinghub-eventbridge-sqs-role-prod:crawlinghub-eventbridge-sqs-policy-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_ssm_parameter.eventbridge_role_arn will be created
  + resource "aws_ssm_parameter" "eventbridge_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "EventBridge IAM Role ARN for invoking SQS"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/eventbridge/role-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-eventbridge-role-arn-prod"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-eventbridge-role-arn-prod"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: reading EventBridge Rule (crawlinghub-scheduler-prod): operation error EventBridge: DescribeRule, https response error StatusCode: 400, RequestID: a262e23b-0008-402d-9f79-a01899f188ca, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/83107d1edadf4fc1958d02bbcad31cd7 is not authorized to perform: events:DescribeRule on resource: arn:aws:events:ap-northeast-2:646886795421:rule/crawlinghub-scheduler-prod because no identity-based policy allows the events:DescribeRule action
│ 
│   with aws_cloudwatch_event_rule.crawler_scheduler,
│   on main.tf line 41, in resource "aws_cloudwatch_event_rule" "crawler_scheduler":
│   41: resource "aws_cloudwatch_event_rule" "crawler_scheduler" {
│ 
╵


```
</details>